# Staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/customer/customer-api/infrastructure/workspaces/staging relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/Connectilly/customer-api-staging/runs/run-j8NzWzSe4supDXjN

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
module.aws_lambda_api.data.aws_iam_policy_document.default: Refreshing...
module.aws_lambda_api.aws_iam_role.test_role: Refreshing state... [id=lambda-execution-customer-api-customer-api-staging]
module.aws_lambda_api.data.aws_iam_policy_document.default: Refresh complete after 0s [id=3693445097]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.aws_lambda_api.aws_iam_role.default will be created
  + resource "aws_iam_role" "default" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lambda-execution-customer-api-customer-api-staging"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "domain"        = "customer"
          + "environment"   = "customer-api-staging"
          + "resource"      = "lambda"
          + "resource-type" = "api"
        }
      + tags_all              = {
          + "domain"        = "customer"
          + "environment"   = "customer-api-staging"
          + "resource"      = "lambda"
          + "resource-type" = "api"
        }
      + unique_id             = (known after apply)
    }

  # module.aws_lambda_api.aws_iam_role.test_role will be destroyed
  # (because aws_iam_role.test_role is not in configuration)
  - resource "aws_iam_role" "test_role" {
      - arn                   = "arn:aws:iam::514472330244:role/lambda-execution-customer-api-customer-api-staging" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-04-22T07:36:05Z" -> null
      - force_detach_policies = false -> null
      - id                    = "lambda-execution-customer-api-customer-api-staging" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "lambda-execution-customer-api-customer-api-staging" -> null
      - path                  = "/" -> null
      - role_last_used        = [
          - {
              - last_used_date = ""
              - region         = ""
            },
        ] -> null
      - tags                  = {
          - "domain"        = "customer"
          - "environment"   = "customer-api-staging"
          - "resource"      = "lambda"
          - "resource-type" = "api"
        } -> null
      - tags_all              = {
          - "domain"        = "customer"
          - "environment"   = "customer-api-staging"
          - "resource"      = "lambda"
          - "resource-type" = "api"
        } -> null
      - unique_id             = "AROAXPSHQYQCP32G4QN6O" -> null
    }

  # module.aws_lambda_api.aws_iam_role_policy_attachment.default will be created
  + resource "aws_iam_role_policy_attachment" "default" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "lambda-execution-customer-api-customer-api-staging"
    }

Plan: 2 to add, 0 to change, 1 to destroy.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*